// Напишите программу, которая принимает на вход трёхзначное число 
// и удаляет вторую цифру этого числа.

/* 
int num = 381;
int first = num / 100 * 10;
int last = num % 10;
int sum = first + last;
Console.Write(sum);
*/

// Напишите программу, которая принимает на вход трёхзначное число
// и возводит вторую цифру этого числа в степень, равную третьей цифре.


// int num = 487;
// int second = num / 10 % 10;
// int third = num % 10;
// int a = 1;
// for (int i = 0; i < third; i++)
// {
//     a = a * second;
// }
// Console.Write(a);


// Напишите программу, которая будет принимать на вход два числа и выводить, является ли первое число кратным второму. 
// Если первое число некратно второму, то программа выводит остаток от деления.

// int first = 4;
// int second = 3;
// int ost = first % second;
// if (ost == 0)
// {
//     Console.Write("Да");
// }
// else
// {
//     Console.Write("Нет, " + ost);
// }


// Напишите программу, которая выводит третью с начала цифру заданного числа
// или сообщает, что третьей цифры нет.

// int num = 455476;
// if (num < 100)
// {
//     Console.Write("Третьей цифры нет");
// }
// else
// {
//     while (num > 999)
//     {
//         num = num / 10;
//     }
//     num = num % 10;
//     Console.Write(num);
// }

